{
  "Logging": {
    "LogLevel": {
      "Default": "Information",
      "Microsoft.AspNetCore": "Warning"
    }
  },
  "AllowedHosts": "*",
  "CvData": {
    "Name": "Agus Handoko, S.T.",
    "Title": "Software Engineer",
    "Email": "agus.handoko.smaga@gmail.com",
    "LinkedIn": "linkedin.com/in/agushandoko",
    "Summary": "A software engineer with a proactive mindset and a passion for continuous improvement. Committed to delivering high-quality results and taking ownership of projects. Strong collaborator who thrives in team environments and adapts quickly to new challenges to help achieve organizational objectives.",
    "ProgrammingSkills": [
      { "Name": ".NET", "Level": 90 },
      { "Name": ".NET Core", "Level": 85 },
      { "Name": "JavaScript", "Level": 80 },
      { "Name": "HTML", "Level": 95 },
      { "Name": "CSS", "Level": 90 },
      { "Name": "AJAX", "Level": 75 }
    ],
    "DatabaseSkills": [
      { "Name": "SQL Server", "Level": 85 },
      { "Name": "MySQL", "Level": 80 },
      { "Name": "AS400", "Level": 60 }
    ],
    "ToolSkills": [
      { "Name": "Power BI", "Level": 70 },
      { "Name": "Dynatrace", "Level": 65 },
      { "Name": "GitHub", "Level": 90 },
      { "Name": "Version Control", "Level": 85 }
    ],
    "WorkExperiences": [
      {
        "Company": "PT Axa Mandiri Financial Services (AMFS)",
        "Period": "Mar 2023 - Present",
        "Responsibilities": [
          "Maintained and monitored critical applications, analyzed usage trends, and delivered timely support in alignment with business-as-usual (BAU) processes and user ticket requirements within SLA.",
          "Developed console applications for system monitoring and process automation, including tasks such as certificate expiration tracking, database job monitoring, and auto file encoding with email notifications.",
          "Collaborated with development teams to improve server, database, and application performance. Proactively responded to incidents and issues, resolving problems efficiently within SLA targets."
        ]
      },
      {
        "Company": "PT Indocyber Global Teknologi",
        "Period": "Sep 2021 - Feb 2023",
        "Responsibilities": [
          "Collaborated with clients to understand their needs and deliver tailored software solutions.",
          "Developed applications and supporting systems using .NET, SQL Server, and JavaScript, ensuring they aligned with user requirements.",
          "Delivered applications to production, ensuring smooth deployment, and took responsibility for ongoing maintenance, monitoring performance, and generating reports for relevant teams."
        ]
      },
      {
        "Company": "PT Reston Bsisn Solusi",
        "Period": "Jan 2018 - Sep 2021",
        "Responsibilities": [
          "Developed customized applications based on client specifications, ensuring delivery within predetermined deadlines and meeting business requirements.",
          "Conducted testing and maintained existing backend systems, including web applications, background services, databases, and reporting services, ensuring system performance and reliability."
        ]
      }
    ],
    "Projects": [
      {
        "Name": "Digital Imaging Process and Case Allocation Distribution (DIPCAD) - AMFS",
        "Period": "Jan 2023 - Feb 2023",
        "Details": [
          "Developed an application to automate the processing and categorization of incoming documents, streamlining workflows and enabling the operational team to manage cases efficiently, improving processing speed and accuracy.",
          "Integrated diverse input sources, including email, document scanning, file uploads, existing workflow images, and API submissions, ensuring seamless document intake.",
          "Implemented case grouping logic to organize and structure documents, enhancing system performance and simplifying operational workflows.",
          "Automated workflows to streamline document grouping and assignment, reducing manual effort and enhancing team productivity."
        ]
      },
      {
        "Name": "eSales Professional Insurance Advisor Backend - Cigna Insurance",
        "Period": "Jul 2018 - Sep 2021",
        "Details": [
          "Designed and maintained a backend system to process insurance sales submitted by agents via a front-end app, forwarding the data to the Underwriting team for further processing and decision-making.",
          "Processed and validated data in the backend, ensuring smooth transition to the Underwriting team for decision-making and policy approval.",
          "Optimized data transfer and system integration for enhanced performance, supporting decision-making workflows."
        ]
      }
    ],
    "Educations": [
      {
        "Institution": "Telkom University",
        "Degree": "Bachelor of Computer Engineering (S.T.)",
        "Period": "Aug 2013 - Aug 2017"
      }
    ]
  }
}
